# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'stripe'
brew 'svn'

# Development
brew 'maven'
brew 'docker'
brew 'docker-compose'

# Apps
cask 'appcleaner'
cask 'iterm2'
cask 'docker'
cask 'firefox-developer-edition'
cask 'visual-studio-code'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
