# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'w3m'
brew 'surfraw'
brew 'mpv'
brew 'task-spooler'
brew 'tmux'
brew 'transmission-cli'
brew 'watch'
brew 'fzf'

# Development
brew 'maven'
brew 'docker'
brew 'docker-compose'

# Apps
cask 'appcleaner'
cask 'iterm2'
cask 'docker'
cask 'firefox-developer-edition'
cask 'visual-studio-code'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
